{"format":"layers-model","generatedBy":"keras","convertedBy":"SunSign Exporter","modelTopology":{"class_name":"Sequential","config":{"name":"sunsign_dual_lstm","layers":[{"class_name":"Masking","config":{"name":"masking","trainable":true,"dtype":"float32","mask_value":0.0,"batch_input_shape":[null,20,144]}},{"class_name":"LSTM","config":{"name":"memory_1","trainable":true,"dtype":"float32","return_sequences":true,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false,"time_major":false,"units":128,"activation":"tanh","recurrent_activation":"sigmoid","use_bias":true,"dropout":0.0,"recurrent_dropout":0.0,"implementation":2,"unit_forget_bias":true,"kernel_initializer":{"class_name":"GlorotUniform","config":{"seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1.0,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null}},{"class_name":"LSTM","config":{"name":"memory_2","trainable":true,"dtype":"float32","return_sequences":false,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false,"time_major":false,"units":64,"activation":"tanh","recurrent_activation":"sigmoid","use_bias":true,"dropout":0.0,"recurrent_dropout":0.0,"implementation":2,"unit_forget_bias":true,"kernel_initializer":{"class_name":"GlorotUniform","config":{"seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1.0,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null}},{"class_name":"Dense","config":{"name":"dense","trainable":true,"dtype":"float32","units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"GlorotUniform","config":{"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null}},{"class_name":"Dropout","config":{"name":"dropout","trainable":true,"dtype":"float32","rate":0.3,"noise_shape":null,"seed":null}},{"class_name":"Dense","config":{"name":"dense_1","trainable":true,"dtype":"float32","units":32,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"GlorotUniform","config":{"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null}}]},"keras_version":"2.4.0","backend":"tensorflow"},"weightsManifest":[{"paths":["group1-shard1of1.bin"],"weights":[{"name":"memory_1/kernel","shape":[144,512],"dtype":"float32"},{"name":"memory_1/recurrent_kernel","shape":[128,512],"dtype":"float32"},{"name":"memory_1/bias","shape":[512],"dtype":"float32"},{"name":"memory_2/kernel","shape":[128,256],"dtype":"float32"},{"name":"memory_2/recurrent_kernel","shape":[64,256],"dtype":"float32"},{"name":"memory_2/bias","shape":[256],"dtype":"float32"},{"name":"dense/kernel","shape":[64,64],"dtype":"float32"},{"name":"dense/bias","shape":[64],"dtype":"float32"},{"name":"dense_1/kernel","shape":[64,32],"dtype":"float32"},{"name":"dense_1/bias","shape":[32],"dtype":"float32"}]}]}