{"format":"layers-model","generatedBy":"keras","convertedBy":"SunSign exporter (TCN, Keras-2 compat)","modelTopology":{"class_name":"Sequential","config":{"name":"sunsign_tcn","layers":[{"class_name":"Conv1D","config":{"name":"tcn_conv1","trainable":true,"dtype":"float32","filters":64,"kernel_size":[3],"strides":[1],"padding":"causal","data_format":"channels_last","dilation_rate":[1],"groups":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"GlorotUniform","config":{"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"batch_input_shape":[null,20,72]}},{"class_name":"BatchNormalization","config":{"name":"tcn_bn1","trainable":true,"dtype":"float32","axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null}},{"class_name":"Dropout","config":{"name":"tcn_drop1","trainable":true,"dtype":"float32","rate":0.2,"noise_shape":null,"seed":null}},{"class_name":"Conv1D","config":{"name":"tcn_conv2","trainable":true,"dtype":"float32","filters":64,"kernel_size":[3],"strides":[1],"padding":"causal","data_format":"channels_last","dilation_rate":[2],"groups":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"GlorotUniform","config":{"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null}},{"class_name":"BatchNormalization","config":{"name":"tcn_bn2","trainable":true,"dtype":"float32","axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null}},{"class_name":"Dropout","config":{"name":"tcn_drop2","trainable":true,"dtype":"float32","rate":0.2,"noise_shape":null,"seed":null}},{"class_name":"Conv1D","config":{"name":"tcn_conv3","trainable":true,"dtype":"float32","filters":128,"kernel_size":[3],"strides":[1],"padding":"causal","data_format":"channels_last","dilation_rate":[4],"groups":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"GlorotUniform","config":{"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null}},{"class_name":"BatchNormalization","config":{"name":"tcn_bn3","trainable":true,"dtype":"float32","axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null}},{"class_name":"Dropout","config":{"name":"tcn_drop3","trainable":true,"dtype":"float32","rate":0.2,"noise_shape":null,"seed":null}},{"class_name":"Conv1D","config":{"name":"tcn_conv4","trainable":true,"dtype":"float32","filters":128,"kernel_size":[3],"strides":[1],"padding":"causal","data_format":"channels_last","dilation_rate":[8],"groups":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"GlorotUniform","config":{"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null}},{"class_name":"BatchNormalization","config":{"name":"tcn_bn4","trainable":true,"dtype":"float32","axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null}},{"class_name":"Dropout","config":{"name":"tcn_drop4","trainable":true,"dtype":"float32","rate":0.2,"noise_shape":null,"seed":null}},{"class_name":"GlobalAveragePooling1D","config":{"name":"global_avg_pool","trainable":true,"dtype":"float32","data_format":"channels_last"}},{"class_name":"Dense","config":{"name":"cls_dense1","trainable":true,"dtype":"float32","units":128,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"GlorotUniform","config":{"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null}},{"class_name":"BatchNormalization","config":{"name":"cls_bn1","trainable":true,"dtype":"float32","axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null}},{"class_name":"Dropout","config":{"name":"cls_drop1","trainable":true,"dtype":"float32","rate":0.3,"noise_shape":null,"seed":null}},{"class_name":"Dense","config":{"name":"cls_dense2","trainable":true,"dtype":"float32","units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"GlorotUniform","config":{"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null}},{"class_name":"Dropout","config":{"name":"cls_drop2","trainable":true,"dtype":"float32","rate":0.2,"noise_shape":null,"seed":null}},{"class_name":"Dense","config":{"name":"output","trainable":true,"dtype":"float32","units":32,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"GlorotUniform","config":{"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null}}]},"keras_version":"2.4.0","backend":"tensorflow"},"weightsManifest":[{"paths":["group1-shard1of1.bin"],"weights":[{"name":"tcn_conv1/kernel","shape":[3,72,64],"dtype":"float32"},{"name":"tcn_conv1/bias","shape":[64],"dtype":"float32"},{"name":"tcn_bn1/gamma","shape":[64],"dtype":"float32"},{"name":"tcn_bn1/beta","shape":[64],"dtype":"float32"},{"name":"tcn_bn1/moving_mean","shape":[64],"dtype":"float32"},{"name":"tcn_bn1/moving_variance","shape":[64],"dtype":"float32"},{"name":"tcn_conv2/kernel","shape":[3,64,64],"dtype":"float32"},{"name":"tcn_conv2/bias","shape":[64],"dtype":"float32"},{"name":"tcn_bn2/gamma","shape":[64],"dtype":"float32"},{"name":"tcn_bn2/beta","shape":[64],"dtype":"float32"},{"name":"tcn_bn2/moving_mean","shape":[64],"dtype":"float32"},{"name":"tcn_bn2/moving_variance","shape":[64],"dtype":"float32"},{"name":"tcn_conv3/kernel","shape":[3,64,128],"dtype":"float32"},{"name":"tcn_conv3/bias","shape":[128],"dtype":"float32"},{"name":"tcn_bn3/gamma","shape":[128],"dtype":"float32"},{"name":"tcn_bn3/beta","shape":[128],"dtype":"float32"},{"name":"tcn_bn3/moving_mean","shape":[128],"dtype":"float32"},{"name":"tcn_bn3/moving_variance","shape":[128],"dtype":"float32"},{"name":"tcn_conv4/kernel","shape":[3,128,128],"dtype":"float32"},{"name":"tcn_conv4/bias","shape":[128],"dtype":"float32"},{"name":"tcn_bn4/gamma","shape":[128],"dtype":"float32"},{"name":"tcn_bn4/beta","shape":[128],"dtype":"float32"},{"name":"tcn_bn4/moving_mean","shape":[128],"dtype":"float32"},{"name":"tcn_bn4/moving_variance","shape":[128],"dtype":"float32"},{"name":"cls_dense1/kernel","shape":[128,128],"dtype":"float32"},{"name":"cls_dense1/bias","shape":[128],"dtype":"float32"},{"name":"cls_bn1/gamma","shape":[128],"dtype":"float32"},{"name":"cls_bn1/beta","shape":[128],"dtype":"float32"},{"name":"cls_bn1/moving_mean","shape":[128],"dtype":"float32"},{"name":"cls_bn1/moving_variance","shape":[128],"dtype":"float32"},{"name":"cls_dense2/kernel","shape":[128,64],"dtype":"float32"},{"name":"cls_dense2/bias","shape":[64],"dtype":"float32"},{"name":"output/kernel","shape":[64,32],"dtype":"float32"},{"name":"output/bias","shape":[32],"dtype":"float32"}]}]}