{"format":"layers-model","generatedBy":"keras","convertedBy":"SunSign exporter (PointNet, Keras-2 compat)","modelTopology":{"class_name":"Sequential","config":{"name":"sunsign_pointnet","layers":[{"class_name":"Reshape","config":{"name":"reshape_points","trainable":true,"dtype":"float32","target_shape":[21,3],"batch_input_shape":[null,63]}},{"class_name":"Conv1D","config":{"name":"pointwise_1","trainable":true,"dtype":"float32","filters":64,"kernel_size":[1],"strides":[1],"padding":"valid","data_format":"channels_last","dilation_rate":[1],"groups":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"GlorotUniform","config":{"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null}},{"class_name":"BatchNormalization","config":{"name":"bn_1","trainable":true,"dtype":"float32","axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null}},{"class_name":"Conv1D","config":{"name":"pointwise_2","trainable":true,"dtype":"float32","filters":128,"kernel_size":[1],"strides":[1],"padding":"valid","data_format":"channels_last","dilation_rate":[1],"groups":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"GlorotUniform","config":{"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null}},{"class_name":"BatchNormalization","config":{"name":"bn_2","trainable":true,"dtype":"float32","axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null}},{"class_name":"Conv1D","config":{"name":"pointwise_3","trainable":true,"dtype":"float32","filters":256,"kernel_size":[1],"strides":[1],"padding":"valid","data_format":"channels_last","dilation_rate":[1],"groups":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"GlorotUniform","config":{"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null}},{"class_name":"BatchNormalization","config":{"name":"bn_3","trainable":true,"dtype":"float32","axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null}},{"class_name":"Conv1D","config":{"name":"pointwise_4","trainable":true,"dtype":"float32","filters":512,"kernel_size":[1],"strides":[1],"padding":"valid","data_format":"channels_last","dilation_rate":[1],"groups":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"GlorotUniform","config":{"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null}},{"class_name":"BatchNormalization","config":{"name":"bn_4","trainable":true,"dtype":"float32","axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null}},{"class_name":"GlobalMaxPooling1D","config":{"name":"global_max_pool","trainable":true,"dtype":"float32","data_format":"channels_last"}},{"class_name":"Dense","config":{"name":"cls_dense_1","trainable":true,"dtype":"float32","units":256,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"GlorotUniform","config":{"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null}},{"class_name":"BatchNormalization","config":{"name":"cls_bn_1","trainable":true,"dtype":"float32","axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null}},{"class_name":"Dropout","config":{"name":"cls_drop_1","trainable":true,"dtype":"float32","rate":0.4,"noise_shape":null,"seed":null}},{"class_name":"Dense","config":{"name":"cls_dense_2","trainable":true,"dtype":"float32","units":128,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"GlorotUniform","config":{"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null}},{"class_name":"BatchNormalization","config":{"name":"cls_bn_2","trainable":true,"dtype":"float32","axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null}},{"class_name":"Dropout","config":{"name":"cls_drop_2","trainable":true,"dtype":"float32","rate":0.3,"noise_shape":null,"seed":null}},{"class_name":"Dense","config":{"name":"cls_dense_3","trainable":true,"dtype":"float32","units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"GlorotUniform","config":{"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null}},{"class_name":"Dropout","config":{"name":"cls_drop_3","trainable":true,"dtype":"float32","rate":0.2,"noise_shape":null,"seed":null}},{"class_name":"Dense","config":{"name":"output","trainable":true,"dtype":"float32","units":32,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"GlorotUniform","config":{"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null}}]},"keras_version":"2.4.0","backend":"tensorflow"},"weightsManifest":[{"paths":["group1-shard1of1.bin"],"weights":[{"name":"pointwise_1/kernel","shape":[1,3,64],"dtype":"float32"},{"name":"pointwise_1/bias","shape":[64],"dtype":"float32"},{"name":"bn_1/gamma","shape":[64],"dtype":"float32"},{"name":"bn_1/beta","shape":[64],"dtype":"float32"},{"name":"bn_1/moving_mean","shape":[64],"dtype":"float32"},{"name":"bn_1/moving_variance","shape":[64],"dtype":"float32"},{"name":"pointwise_2/kernel","shape":[1,64,128],"dtype":"float32"},{"name":"pointwise_2/bias","shape":[128],"dtype":"float32"},{"name":"bn_2/gamma","shape":[128],"dtype":"float32"},{"name":"bn_2/beta","shape":[128],"dtype":"float32"},{"name":"bn_2/moving_mean","shape":[128],"dtype":"float32"},{"name":"bn_2/moving_variance","shape":[128],"dtype":"float32"},{"name":"pointwise_3/kernel","shape":[1,128,256],"dtype":"float32"},{"name":"pointwise_3/bias","shape":[256],"dtype":"float32"},{"name":"bn_3/gamma","shape":[256],"dtype":"float32"},{"name":"bn_3/beta","shape":[256],"dtype":"float32"},{"name":"bn_3/moving_mean","shape":[256],"dtype":"float32"},{"name":"bn_3/moving_variance","shape":[256],"dtype":"float32"},{"name":"pointwise_4/kernel","shape":[1,256,512],"dtype":"float32"},{"name":"pointwise_4/bias","shape":[512],"dtype":"float32"},{"name":"bn_4/gamma","shape":[512],"dtype":"float32"},{"name":"bn_4/beta","shape":[512],"dtype":"float32"},{"name":"bn_4/moving_mean","shape":[512],"dtype":"float32"},{"name":"bn_4/moving_variance","shape":[512],"dtype":"float32"},{"name":"cls_dense_1/kernel","shape":[512,256],"dtype":"float32"},{"name":"cls_dense_1/bias","shape":[256],"dtype":"float32"},{"name":"cls_bn_1/gamma","shape":[256],"dtype":"float32"},{"name":"cls_bn_1/beta","shape":[256],"dtype":"float32"},{"name":"cls_bn_1/moving_mean","shape":[256],"dtype":"float32"},{"name":"cls_bn_1/moving_variance","shape":[256],"dtype":"float32"},{"name":"cls_dense_2/kernel","shape":[256,128],"dtype":"float32"},{"name":"cls_dense_2/bias","shape":[128],"dtype":"float32"},{"name":"cls_bn_2/gamma","shape":[128],"dtype":"float32"},{"name":"cls_bn_2/beta","shape":[128],"dtype":"float32"},{"name":"cls_bn_2/moving_mean","shape":[128],"dtype":"float32"},{"name":"cls_bn_2/moving_variance","shape":[128],"dtype":"float32"},{"name":"cls_dense_3/kernel","shape":[128,64],"dtype":"float32"},{"name":"cls_dense_3/bias","shape":[64],"dtype":"float32"},{"name":"output/kernel","shape":[64,32],"dtype":"float32"},{"name":"output/bias","shape":[32],"dtype":"float32"}]}]}